# Домашнее задание к занятию "`Кластеризация`" - `Боровский Юрий`



### Задание 1

SMP-система имеет общую память, процессорные единицы и одну систему обработки ввода-вывода. 
MPP-системы имеют изолированные друг от друга процессорные юниты, систему ввода-вывода и отдельную память для каждой процессорной единицы. 
Таким образом, каждая из вычислительных систем в MPP работает как отдельная компьютерная система и лишь обменивается информацией с остальными.


---

### Задание 2

Сильносвязаныне системы состоят из однородных процессоров и общей памяти.
У слабосвязанных систем для каждого процессора используется свой блок памяти.


---

### Задание 3

Маштабируемость и возможность ее безболезненного наращинвания.
Наращивание мощности без потери данных и простоя
Возможность быстро приступить к выполнению разных задач
Надежность
Соотношение цена/производительность
Возможность построить кластер из любых серверов



---
### Задание 4

High-availability clusters
Load balancing clusters
High performance computing clusters
Системы распредленных вычислений


---

В системах распределенных вычислений



### Задание 5




